lpodkalicki/blog/avr/asm/include/ATxmega32A4Udef.inc
; Inactive Timeout
.equ TWI_MASTER_TIMEOUT_DISABLED_gc = (0x00<<2) ; Bus Timeout Disabled
.equ TWI_MASTER_TIMEOUT_50US_gc = (0x01<<2) ; 50 Microseconds
.equ TWI_MASTER_TIMEOUT_100US_gc = (0x02<<2) ; 100 Microseconds
.equ TWI_MASTER_TIMEOUT_200US_gc = (0x03<<2) ; 200 Microseconds

; Master Command
.equ TWI_MASTER_CMD_NOACT_gc = (0x00<<0) ; No Action
.equ TWI_MASTER_CMD_REPSTART_gc = (0x01<<0) ; Issue Repeated Start Condition
.equ TWI_MASTER_CMD_RECVTRANS_gc = (0x02<<0) ; Receive or Transmit Data
.equ TWI_MASTER_CMD_STOP_gc = (0x03<<0) ; Issue Stop Condition

; Master Bus State
.equ TWI_MASTER_BUSSTATE_UNKNOWN_gc = (0x00<<0) ; Unknown Bus State
.equ TWI_MASTER_BUSSTATE_IDLE_gc = (0x01<<0) ; Bus is Idle
.equ TWI_MASTER_BUSSTATE_OWNER_gc = (0x02<<0) ; This Module Controls The Bus
.equ TWI_MASTER_BUSSTATE_BUSY_gc = (0x03<<0) ; The Bus is Busy

; Slave Interrupt Level
.equ TWI_SLAVE_INTLVL_OFF_gc = (0x00<<6) ; Interrupt Disabled
.equ TWI_SLAVE_INTLVL_LO_gc = (0x01<<6) ; Low Level
.equ TWI_SLAVE_INTLVL_MED_gc = (0x02<<6) ; Medium Level
.equ TWI_SLAVE_INTLVL_HI_gc = (0x03<<6) ; High Level

; Slave Command
.equ TWI_SLAVE_CMD_NOACT_gc = (0x00<<0) ; No Action
.equ TWI_SLAVE_CMD_COMPTRANS_gc = (0x02<<0) ; Used To Complete a Transaction
.equ TWI_SLAVE_CMD_RESPONSE_gc = (0x03<<0) ; Used in Response to Address/Data Interrupt


;***************************************************************************
;** USB - USB
;***************************************************************************/

; USB_EP_STATUS masks
.equ USB_EP_STALLF_bm = 0x80 ; Endpoint Stall Flag bit mask
.equ USB_EP_STALLF_bp = 7 ; Endpoint Stall Flag bit position
.equ USB_EP_CRC_bm = 0x80 ; CRC Error Flag bit mask
.equ USB_EP_CRC_bp = 7 ; CRC Error Flag bit position
.equ USB_EP_UNF_bm = 0x40 ; Underflow Enpoint FLag bit mask
.equ USB_EP_UNF_bp = 6 ; Underflow Enpoint FLag bit position
.equ USB_EP_OVF_bm = 0x40 ; Overflow Enpoint Flag for Output Endpoints bit mask
.equ USB_EP_OVF_bp = 6 ; Overflow Enpoint Flag for Output Endpoints bit position
.equ USB_EP_TRNCOMPL0_bm = 0x20 ; Transaction Complete 0 Flag bit mask
.equ USB_EP_TRNCOMPL0_bp = 5 ; Transaction Complete 0 Flag bit position
.equ USB_EP_TRNCOMPL1_bm = 0x10 ; Transaction Complete 1 Flag bit mask
.equ USB_EP_TRNCOMPL1_bp = 4 ; Transaction Complete 1 Flag bit position
.equ USB_EP_SETUP_bm = 0x10 ; SETUP Transaction Complete Flag bit mask
.equ USB_EP_SETUP_bp = 4 ; SETUP Transaction Complete Flag bit position
.equ USB_EP_BANK_bm = 0x08 ; Bank Select bit mask
.equ USB_EP_BANK_bp = 3 ; Bank Select bit position
.equ USB_EP_BUSNACK1_bm = 0x04 ; Data Buffer 1 Not Acknowledge bit mask
.equ USB_EP_BUSNACK1_bp = 2 ; Data Buffer 1 Not Acknowledge bit position
.equ USB_EP_BUSNACK0_bm = 0x02 ; Data Buffer 0 Not Acknowledge bit mask
.equ USB_EP_BUSNACK0_bp = 1 ; Data Buffer 0 Not Acknowledge bit position
.equ USB_EP_TOGGLE_bm = 0x01 ; Data Toggle bit mask
.equ USB_EP_TOGGLE_bp = 0 ; Data Toggle bit position

; USB_EP_CTRL masks
.equ USB_EP_TYPE_gm = 0xC0 ; Endpoint Type group mask
.equ USB_EP_TYPE_gp = 6 ; Endpoint Type group position
.equ USB_EP_TYPE0_bm = (1<<6) ; Endpoint Type bit 0 mask
.equ USB_EP_TYPE0_bp = 6 ; Endpoint Type bit 0 position
.equ USB_EP_TYPE1_bm = (1<<7) ; Endpoint Type bit 1 mask
.equ USB_EP_TYPE1_bp = 7 ; Endpoint Type bit 1 position
.equ USB_EP_MULTIPKT_bm = 0x20 ; Multi Packet Transfer Enable bit mask
.equ USB_EP_MULTIPKT_bp = 5 ; Multi Packet Transfer Enable bit position
.equ USB_EP_PINGPONG_bm = 0x10 ; Ping-Pong Enable bit mask
.equ USB_EP_PINGPONG_bp = 4 ; Ping-Pong Enable bit position
.equ USB_EP_INTDSBL_bm = 0x08 ; Interrupt Disable bit mask
.equ USB_EP_INTDSBL_bp = 3 ; Interrupt Disable bit position
.equ USB_EP_STALL_bm = 0x04 ; Data Stall bit mask
.equ USB_EP_STALL_bp = 2 ; Data Stall bit position
.equ USB_EP_BUFSIZE_gm = 0x07 ; Data Buffer Size group mask
.equ USB_EP_BUFSIZE_gp = 0 ; Data Buffer Size group position
.equ USB_EP_BUFSIZE0_bm = (1<<0) ; Data Buffer Size bit 0 mask
.equ USB_EP_BUFSIZE0_bp = 0 ; Data Buffer Size bit 0 position
.equ USB_EP_BUFSIZE1_bm = (1<<1) ; Data Buffer Size bit 1 mask
.equ USB_EP_BUFSIZE1_bp = 1 ; Data Buffer Size bit 1 position
.equ USB_EP_BUFSIZE2_bm = (1<<2) ; Data Buffer Size bit 2 mask
.equ USB_EP_BUFSIZE2_bp = 2 ; Data Buffer Size bit 2 position

; USB_CTRLA masks
.equ USB_ENABLE_bm = 0x80 ; USB Enable bit mask
.equ USB_ENABLE_bp = 7 ; USB Enable bit position
.equ USB_SPEED_bm = 0x40 ; Speed Select bit mask
.equ USB_SPEED_bp = 6 ; Speed Select bit position
.equ USB_FIFOEN_bm = 0x20 ; USB FIFO Enable bit mask
.equ USB_FIFOEN_bp = 5 ; USB FIFO Enable bit position
.equ USB_STFRNUM_bm = 0x10 ; Store Frame Number Enable bit mask
.equ USB_STFRNUM_bp = 4 ; Store Frame Number Enable bit position
.equ USB_MAXEP_gm = 0x0F ; Maximum Endpoint Addresses group mask
.equ USB_MAXEP_gp = 0 ; Maximum Endpoint Addresses group position
.equ USB_MAXEP0_bm = (1<<0) ; Maximum Endpoint Addresses bit 0 mask
.equ USB_MAXEP0_bp = 0 ; Maximum Endpoint Addresses bit 0 position
.equ USB_MAXEP1_bm = (1<<1) ; Maximum Endpoint Addresses bit 1 mask
.equ USB_MAXEP1_bp = 1 ; Maximum Endpoint Addresses bit 1 position
.equ USB_MAXEP2_bm = (1<<2) ; Maximum Endpoint Addresses bit 2 mask
.equ USB_MAXEP2_bp = 2 ; Maximum Endpoint Addresses bit 2 position
.equ USB_MAXEP3_bm = (1<<3) ; Maximum Endpoint Addresses bit 3 mask
.equ USB_MAXEP3_bp = 3 ; Maximum Endpoint Addresses bit 3 position

; USB_CTRLB masks
.equ USB_PULLRST_bm = 0x10 ; Pull during Reset bit mask
.equ USB_PULLRST_bp = 4 ; Pull during Reset bit position
.equ USB_RWAKEUP_bm = 0x04 ; Remote Wake-up bit mask
.equ USB_RWAKEUP_bp = 2 ; Remote Wake-up bit position
.equ USB_GNACK_bm = 0x02 ; Global NACK bit mask
.equ USB_GNACK_bp = 1 ; Global NACK bit position
.equ USB_ATTACH_bm = 0x01 ; Attach bit mask
.equ USB_ATTACH_bp = 0 ; Attach bit position

; USB_STATUS masks
.equ USB_URESUME_bm = 0x08 ; Upstream Resume bit mask
.equ USB_URESUME_bp = 3 ; Upstream Resume bit position
.equ USB_RESUME_bm = 0x04 ; Resume bit mask
.equ USB_RESUME_bp = 2 ; Resume bit position
.equ USB_SUSPEND_bm = 0x02 ; Bus Suspended bit mask
.equ USB_SUSPEND_bp = 1 ; Bus Suspended bit position
.equ USB_BUSRST_bm = 0x01 ; Bus Reset bit mask
.equ USB_BUSRST_bp = 0 ; Bus Reset bit position

